Repository: banghuazhao/habit-diary
Catalog: HabitDiary/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

source: %@ - Upgrade to Premium
zh_hans: %@ - 升级到高级版
zh_hant: %@ - 升級到高級版

source: %lld day
zh_hans: %lld 天
zh_hant: %lld 天

source: %lld days
zh_hans: %lld 天
zh_hant: %lld 天

source: %lld days each month
zh_hans: 每月 %lld 天
zh_hant: 每月 %lld 天

source: %lld days each week
zh_hans: 每周 %lld 天
zh_hant: 每週 %lld 天

source: %lld habits selected
zh_hans: 已选择 %lld 个习惯
zh_hant: 已選擇 %lld 個習慣

# %lld of %lld unlocked
source: %1$lld of %2$lld unlocked
zh_hans: 已解锁 %1$lld/%2$lld
zh_hant: 已解鎖 %1$lld/%2$lld

source: %lld points
zh_hans: %lld 分
zh_hant: %lld 分

source: %lld points needed
zh_hans: 还需 %lld 分
zh_hant: 還需 %lld 分

# %lld-%lld points
source: %1$lld-%2$lld points
zh_hans: %1$lld-%2$lld 分
zh_hant: %1$lld-%2$lld 分

# %lld/%lld this month
source: %1$lld/%2$lld this month
zh_hans: %1$lld/%2$lld 本月
zh_hant: %1$lld/%2$lld 本月

# %lld/%lld this week
source: %1$lld/%2$lld this week
zh_hans: %1$lld/%2$lld 本周
zh_hant: %1$lld/%2$lld 本週

source: %lld+ points
zh_hans: %lld+ 分
zh_hant: %lld+ 分

source: < Previous
zh_hans: < 上一页
zh_hant: < 上一頁

source: 🎉 Achievement Unlocked! 🎉
zh_hans: 🎉 成就解锁！🎉
zh_hant: 🎉 成就解鎖！🎉

source: 💎 Thanks for being a Premium member!
zh_hans: 💎 感谢您成为高级会员！
zh_hant: 💎 感謝您成為高級會員！

source: 🔥 %lldd streak
zh_hans: 🔥 连续%lld天
zh_hant: 🔥 連續%lld天

source: 🔥 1d streak
zh_hans: 🔥 连续1天
zh_hant: 🔥 連續1天

source: 1 day each month
zh_hans: 每月 1 天
zh_hant: 每月 1 天

source: 1 day each week
zh_hans: 每周一天
zh_hant: 每週一天

source: 1 point per check-in across all habits. Every completed habit counts toward your total score.
zh_hans: 每次打卡1分，涵盖所有习惯。每完成一个习惯都计入您的总分。
zh_hant: 每次打卡1分，涵蓋所有習慣。每完成一個習慣都計入您的總分。

source: 1/%lld this month
zh_hans: 1/%lld本月
zh_hant: 1/%lld本月

source: 1/%lld this week
zh_hans: 1/%lld本周
zh_hant: 1/%lld本週

source: 5 points per day in your longest consecutive streak. Building long streaks shows exceptional consistency and dedication.
zh_hans: 最长连续记录每天5分。建立长期连续记录显示出卓越的坚持性和专注度。
zh_hant: 最長連續記錄每天5分。建立長期連續記錄顯示出卓越的堅持性和專注度。

source: 10 points per active habit. Focus on quality over quantity - having 10-20 consistent habits is better than many inactive ones.
zh_hans: 每个活跃习惯10分。注重质量而非数量——拥有10-20个坚持的习惯比许多不活跃的习惯更好。
zh_hant: 每個活躍習慣10分。注重質量而非數量——擁有10-20個堅持的習慣比許多不活躍的習慣更好。

source: 10 points per unlocked achievement. Complete challenges like streaks, consistency goals, and milestones to earn more points.
zh_hans: 每解锁一个成就得10分。完成连续记录、坚持目标和里程碑等挑战获得更多分数。
zh_hant: 每解鎖一個成就得10分。完成連續記錄、堅持目標和里程碑等挑戰獲得更多分數。

source: 35+ habit templates across health, productivity, learning, relationships, and personal growth.
zh_hans: 涵盖健康、生产力、学习、人际关系和个人成长的35+习惯模板。
zh_hant: 涵蓋健康、生產力、學習、人際關係和個人成長的35+習慣模板。

source: Achievement Unlocked!
zh_hans: 成就解锁！
zh_hant: 成就解鎖！

source: achievements
zh_hans: 成就
zh_hant: 成就

source: Achievements
zh_hans: 成就
zh_hant: 成就

source: Active Habits
zh_hans: 活跃习惯
zh_hant: 活躍習慣

source: Ad-free experience
zh_hans: 无广告体验
zh_hant: 無廣告體驗

source: Add a Reminder
zh_hans: 添加提醒
zh_hant: 添加提醒

source: Add Reminder
zh_hans: 添加提醒
zh_hant: 添加提醒

source: Add to Favorites
zh_hans: 添加到收藏
zh_hant: 添加到收藏

source: Advance through 12 levels from Beginner (F) to Legend (SSS) based on your habit consistency and achievements.
zh_hans: 基于您的习惯一致性和成就，从初学者(F)到传奇(SSS)晋升12个等级。
zh_hant: 基於您的習慣一致性和成就，從初學者(F)到傳奇(SSS)晉升12個等級。

source: Advanced
zh_hans: 高级
zh_hant: 高級

source: Advanced level achieved! You're crushing it! 🏆
zh_hans: 已达到高级水平！您表现得非常棒！🏆
zh_hant: 已達到高級水平！您表現得非常棒！🏆

source: Advanced+
zh_hans: 高级+
zh_hant: 高級+

source: After being completed on %lld day, the habit will not show up again this month.
zh_hans: 在 %lld 天完成后，该习惯本月将不再显示。
zh_hant: 在 %lld 天完成後，該習慣本月將不再顯示。

source: After being completed on %lld day, the habit will not show up again this week.
zh_hans: 在 %lld 天完成后，该习惯本周将不再显示。
zh_hant: 在 %lld 天完成後，該習慣本週將不再顯示。

source: After being completed on %lld days, the habit will not show up again this month.
zh_hans: 在 %lld 天完成后，该习惯本月将不再显示。
zh_hant: 在 %lld 天完成後，該習慣本月將不再顯示。

source: After being completed on %lld days, the habit will not show up again this week.
zh_hans: 在 %lld 天完成后，该习惯本周将不再显示。
zh_hant: 在 %lld 天完成後，該習慣本週將不再顯示。

source: All
zh_hans: 全部
zh_hant: 全部

source: all time
zh_hans: 总计
zh_hant: 總計

source: Apprentice
zh_hans: 学徒
zh_hant: 學徒

source: Apprentice+
zh_hans: 学徒+
zh_hant: 學徒+

source: Archive
zh_hans: 存档
zh_hant: 封存

source: Archive unused habits to keep your list clean
zh_hans: 归档未使用的习惯以保持列表整洁
zh_hant: 封存未使用的習慣以保持清單整潔

source: Archived
zh_hans: 已存档
zh_hant: 已封存

source: Archived Habits
zh_hans: 已归档习惯
zh_hant: 已封存習慣

source: At most 64 notifications allowed. Currently %lld set.
zh_hans: 最多允许 64 个通知。目前已设置 %lld 个。
zh_hant: 最多允許 64 個通知。目前已設置 %lld 個。

source: Available
zh_hans: 可用
zh_hant: 可用

source: Average Streak
zh_hans: 平均连胜
zh_hant: 平均連勝

source: Avoid added sugar
zh_hans: 避免添加糖
zh_hant: 避免添加糖

source: Avoid electronic devices before bedtime for better sleep quality.
zh_hans: 睡前避免使用电子设备，提高睡眠质量。
zh_hant: 睡前避免使用電子設備，提高睡眠品質。

source: Back
zh_hans: 返回
zh_hant: 返回

source: Be the person your dog thinks you are.
zh_hans: 成为你的狗认为你是的那个人。
zh_hant: 成為你的狗認為你是的那個人。

source: Be yourself, but always your better self.
zh_hans: 做自己，但要做更好的自己。
zh_hant: 做自己，但要做更好的自己。

source: Begin Your Journey
zh_hans: 开始您的旅程
zh_hant: 開始您的旅程

source: Beginner
zh_hans: 初学者
zh_hant: 初學者

source: Believe you can and you're halfway there.
zh_hans: 相信你能做到，你就已经成功了一半。
zh_hant: 相信你能做到，你就已經成功了一半。

source: Best Habit
zh_hans: 最佳习惯
zh_hant: 最佳習慣

source: Blue
zh_hans: 蓝色
zh_hant: 藍色

source: Build Consistency
zh_hans: 建立一致性
zh_hant: 建立一致性

source: Build momentum with consistent daily check-ins
zh_hans: 通过一致的每日打卡建立动力
zh_hant: 通過一致的每日打卡建立動力

source: Call family/friends
zh_hans: 联系家人朋友
zh_hant: 聯繫家人朋友

source: Cancel
zh_hans: 取消
zh_hant: 取消

source: Category
zh_hans: 类别
zh_hant: 類別

source: Celebrate milestones to stay motivated
zh_hans: 庆祝里程碑以保持动力
zh_hant: 慶祝里程碑以保持動力

source: Champions are made in the offseason.
zh_hans: 冠军是在淡季造就的。
zh_hant: 冠軍是在淡季造就的。

source: Change
zh_hans: 更改
zh_hant: 更改

source: Change is inevitable. Growth is optional.
zh_hans: 改变不可避免，成长是选择。
zh_hant: 改變不可避免，成長是選擇。

source: Check in consistently to reach milestone achievements
zh_hans: 持续打卡以达到里程碑成就
zh_hant: 持續打卡以達到里程碑成就

source: Check in daily to build consistency
zh_hans: 每日打卡以建立一致性
zh_hant: 每日打卡以建立一致性

source: Check out my Habit rating from Habit Diary!
zh_hans: 去看看我从习惯养成家得出的习惯评分！
zh_hant: 去看看我從習慣養成家得出的習慣評分！

source: Check out this achievement I unlocked in Habit Diary!
zh_hans: 看看我在习惯养成家中解锁的成就！
zh_hant: 看看我在習慣養成家中解鎖的成就！

source: Check your Today tab daily to track progress and maintain streaks.
zh_hans: 每天查看"今日"标签，跟踪进度并保持连续记录。
zh_hant: 每天查看「今日」標籤，跟蹤進度並保持連續記錄。

source: Check-in History
zh_hans: 签到历史
zh_hant: 簽到歷史

source: Check-ins
zh_hans: 打卡
zh_hant: 打卡

source: Checkin History
zh_hans: 打卡历史
zh_hant: 打卡歷史

source: Checkin Sound
zh_hans: 签到音效
zh_hant: 簽到音效

source: Chinese Proverb
zh_hans: 中国谚语
zh_hant: 中國諺語

source: Choose from daily, weekly, or custom frequency patterns that fit your lifestyle perfectly.
zh_hans: 选择完美适合您生活方式的每日、每周或自定义频率模式。
zh_hant: 選擇完美適合您生活方式的每日、每週或自定義頻率模式。

source: Choose Your Habits
zh_hans: 选择您的习惯
zh_hant: 選擇您的習慣

source: Choose Your Starting Habits
zh_hans: 选择您的初始习惯
zh_hant: 選擇您的初始習慣

source: complete
zh_hans: 完成
zh_hant: 完成

source: Complete daily habits to unlock streak achievements
zh_hans: 完成每日习惯以解锁连胜成就
zh_hant: 完成每日習慣以解鎖連勝成就

source: Complete habits early or late for time-based achievements
zh_hans: 在早期或晚期完成习惯以获得基于时间的成就
zh_hant: 在早期或晚期完成習慣以獲得基於時間的成就

source: Complete various challenges to earn achievement points
zh_hans: 完成各种挑战以获得成就积分
zh_hant: 完成各種挑戰以獲得成就積分

source: Comprehensive Categories
zh_hans: 全面分类
zh_hant: 全面分類

source: Congratulations!
zh_hans: 恭喜！
zh_hant: 恭喜！

source: consistency
zh_hans: 一致性
zh_hant: 一致性

source: Consistency is key! You're developing a great routine! 📈
zh_hans: 坚持是关键！您正在养成良好的习惯！📈
zh_hant: 堅持是關鍵！您正在養成良好的習慣！📈

source: Consistency is the mother of mastery.
zh_hans: 坚持是精通之母。
zh_hant: 堅持是精通之母。

source: Consistent
zh_hans: 坚持不懈
zh_hant: 堅持不懈

source: Consume at least 3 servings of vegetables for essential nutrients.
zh_hans: 每天摄入至少3份蔬菜以获取必需营养素。
zh_hant: 每天攝入至少3份蔬菜以獲取必需營養素。

source: Contact Support
zh_hans: 联系支持
zh_hant: 聯繫支援

source: Continue
zh_hans: 继续
zh_hant: 繼續

source: Cook healthy meal
zh_hans: 烹饪健康餐食
zh_hant: 烹飪健康餐食

source: Create Daily Reminder
zh_hans: 创建每日提醒
zh_hant: 創建每日提醒

source: Create new habits to increase your score
zh_hans: 创建新习惯以提高你的分数
zh_hant: 創建新習慣以提高你的分數

source: Creative activity
zh_hans: 创意活动
zh_hant: 創意活動

source: Current Streak
zh_hans: 当前连胜
zh_hant: 當前連勝

source: Daily Motivational Quotes
zh_hans: 每日励志语录
zh_hant: 每日勵志語錄

source: Dark Mode
zh_hans: 黑夜模式
zh_hant: 夜間模式

source: days
zh_hans: 天
zh_hant: 天

source: Days Active
zh_hans: 活跃天数
zh_hant: 活躍天數

source: days max
zh_hans: 天最大
zh_hant: 天最大

source: Declutter 15 minutes
zh_hans: 整理15分钟
zh_hant: 整理15分鐘

source: Dedicate time to practice a hobby or professional skill.
zh_hans: 花时间练习爱好或专业技能。
zh_hant: 花時間練習愛好或專業技能。

source: Deep breathing exercise
zh_hans: 深呼吸练习
zh_hant: 深呼吸練習

source: Default
zh_hans: 默认
zh_hant: 預設

source: Delete
zh_hans: 删除
zh_hant: 刪除

source: Delete ‘%@’?
zh_hans: 删除 '%@'？
zh_hant: 刪除 '%@'？

source: Delete %@?
zh_hans: 删除 %@？
zh_hant: 刪除 %@？

source: Description
zh_hans: 描述
zh_hant: 描述

source: Discipline is the bridge between goals and accomplishment.
zh_hans: 自律是目标与成就之间的桥梁。
zh_hant: 自律是目標與成就之間的橋樑。

source: Discover the features that make habit building engaging and effective
zh_hans: 探索让习惯养成更加有趣高效的功能
zh_hant: 探索讓習慣養成更加有趣高效的功能

source: Dismiss
zh_hans: 关闭
zh_hant: 關閉

source: Do a kind act
zh_hans: 做善事
zh_hant: 做善事

source: Do stretching exercises to improve flexibility and prevent injury.
zh_hans: 进行拉伸运动以提高柔韧性并预防受伤。
zh_hant: 進行拉伸運動以提高柔韌性並預防受傷。

source: Doing Well
zh_hans: 表现良好
zh_hant: 表現良好

source: Don't break the chain. Every day counts.
zh_hans: 不要断链。每一天都很重要。
zh_hant: 不要斷鏈。每一天都很重要。

source: Don't break your streak - even one check-in counts
zh_hans: 不要打破您的连胜 - 即使一次打卡也算数
zh_hant: 不要打破您的連勝 - 即使一次打卡也算數

source: Don't compare your chapter 1 to someone else's chapter 20.
zh_hans: 不要拿你的第一章与别人的第二十章比较。
zh_hant: 不要拿你的第一章與別人的第二十章比較。

source: Don't count the days, make the days count.
zh_hans: 不要数日子，要让日子有意义。
zh_hant: 不要數日子，要讓日子有意義。

source: Done
zh_hans: 完成
zh_hant: 完成

source: Drink 8 glasses of water
zh_hans: 喝8杯水
zh_hant: 喝8杯水

source: Early Bird
zh_hans: 早起的鸟儿
zh_hant: 早起的鳥兒

source: Earn achievements and climb the rating ladder to Legend status!
zh_hans: 获得成就并攀登评级阶梯至传奇地位！
zh_hant: 獲得成就並攀登評級階梯至傳奇地位！

source: Eat fruits
zh_hans: 吃水果
zh_hant: 吃水果

source: Eat vegetables
zh_hans: 吃蔬菜
zh_hant: 吃蔬菜

source: Edit
zh_hans: 编辑
zh_hant: 編輯

source: Edit Habit
zh_hans: 编辑习惯
zh_hant: 編輯習慣

source: Edit Reminder
zh_hans: 编辑提醒
zh_hant: 編輯提醒

source: Elite habit builder! Your discipline is incredible! 💎
zh_hans: 精英习惯养成者！您的自律能力令人惊叹！💎
zh_hant: 精英習慣養成者！您的自律能力令人驚嘆！💎

source: Engage in creative activities like drawing, writing, or crafting.
zh_hans: 参与绘画、写作或手工制作等创意活动。
zh_hant: 參與繪畫、寫作或手工製作等創意活動。

source: Engage in social activities to maintain relationships and well-being.
zh_hans: 参与社交活动以维持人际关系和身心健康。
zh_hant: 參與社交活動以維持人際關係和身心健康。

source: Enjoy a clean, ad-free habit tracking experience.
zh_hans: 享受无广告的习惯跟踪体验。
zh_hant: 享受無廣告的習慣追蹤體驗。

source: Every %@ of month
zh_hans: 每月的 %@
zh_hant: 每月的 %@

source: Every %@ of week
zh_hans: 每周的 %@
zh_hant: 每週的 %@

source: Every day is a new opportunity to improve yourself.
zh_hans: 每一天都是提升自己的新机会。
zh_hant: 每一天都是提升自己的新機會。

source: Every expert was once a beginner. You've got this! 🌱
zh_hans: 每个专家都曾是初学者。你可以做到！🌱
zh_hant: 每個專家都曾是初學者。你可以做到！🌱

source: Every master was once a beginner. Every pro was once an amateur.
zh_hans: 每个大师都曾是初学者。每个专业人士都曾是业余者。
zh_hant: 每個大師都曾是初學者。每個專業人士都曾是業餘者。

source: Every moment is a fresh beginning.
zh_hans: 每一刻都是全新的开始。
zh_hant: 每一刻都是全新的開始。

source: Excellence is a continuous process and not an accident.
zh_hans: 卓越是一个持续的过程，而非偶然。
zh_hant: 卓越是一個持續的過程，而非偶然。

source: Excellent
zh_hans: 优秀
zh_hant: 優秀

source: Excellent! You've selected %lld habits. Focus on building these consistently, and watch your rating grow from Beginner to Legend!
zh_hans: 太棒了！您选择了%lld个习惯。专注坚持养成这些习惯，看着您的评级从初学者成长为传奇！
zh_hant: 太棒了！您選擇了%lld個習慣。專注堅持養成這些習慣，看著您的評級從初學者成長為傳奇！

source: Expert
zh_hans: 专家
zh_hant: 專家

source: Expert status unlocked! You're in the top tier! 👑
zh_hans: 专家级别解锁！您已进入顶级行列！👑
zh_hant: 專家級別解鎖！您已進入頂級行列！👑

source: Fall seven times, rise eight.
zh_hans: 跌倒七次，起身八次。
zh_hant: 跌倒七次，起身八次。

source: Favorite
zh_hans: 收藏
zh_hant: 收藏

source: Favorites
zh_hans: 收藏
zh_hant: 收藏

source: Feedback
zh_hans: 反馈
zh_hant: 回饋

source: Filter By
zh_hans: 按条件筛选
zh_hant: 按條件篩選

source: Flexible Scheduling
zh_hans: 灵活安排
zh_hant: 靈活安排

source: Focus on daily check-ins rather than perfect performance
zh_hans: 专注于每日打卡而不是完美表现
zh_hant: 專注於每日打卡而不是完美表現

source: Focus on habits with higher anti-aging ratings for better scores
zh_hans: 专注于具有更高抗衰老评分的习惯以获得更好的分数
zh_hant: 專注於具有更高抗衰老評分的習慣以獲得更好的分數

source: Follow a consistent skincare routine for healthy skin.
zh_hans: 坚持护肤程序，保持肌肤健康。
zh_hant: 堅持護膚程序，保持肌膚健康。

source: Frequency
zh_hans: 频率
zh_hant: 頻率

source: Gallery
zh_hans: 抗衰库
zh_hant: 抗衰庫

source: Get morning sunlight
zh_hans: 晨光照射
zh_hant: 晨光照射

source: Get Started
zh_hans: 开始使用
zh_hant: 開始使用

source: Go to bed early on weekdays to ensure adequate rest.
zh_hans: 工作日早睡以确保充足休息。
zh_hant: 工作日早睡以確保充足休息。

source: Go to Settings
zh_hans: 前往设置
zh_hant: 前往設定

source: Great things never come from comfort zones.
zh_hans: 伟大的事情从来不会在舒适圈中诞生。
zh_hant: 偉大的事情從來不會在舒適圈中誕生。

source: Green
zh_hans: 绿色
zh_hant: 綠色

source: Habit Insights
zh_hans: 习惯洞察
zh_hant: 習慣洞察

source: Habit Rating
zh_hans: 习惯评级
zh_hant: 習慣評級

source: Habit Rating System
zh_hans: 习惯评级系统
zh_hant: 習慣評級系統

source: Habits
zh_hans: 习惯
zh_hant: 習慣

source: Halfway there! Your dedication is paying off! 💪
zh_hans: 已经完成一半！您的坚持正在获得回报！💪
zh_hant: 已經完成一半！您的堅持正在獲得回報！💪

source: How %@ Score is Calculated
zh_hans: %@ 分数是如何计算的
zh_hant: %@ 分數是如何計算的

source: How It's Calculated
zh_hans: 如何计算
zh_hant: 如何計算

source: If you get 1% better each day for one year, you'll end up 37 times better.
zh_hans: 如果您每天进步1%，一年后您将进步37倍。
zh_hant: 如果您每天進步1%，一年後您將進步37倍。

source: Impressive consistency! You're an inspiration! ⭐
zh_hans: 令人印象深刻的坚持！您就是榜样！⭐
zh_hant: 令人印象深刻的堅持！您就是榜樣！⭐

source: Include at least 2 servings of fresh fruits in your daily diet.
zh_hans: 每日饮食中至少包含2份新鲜水果。
zh_hant: 每日飲食中至少包含2份新鮮水果。

source: Intermediate
zh_hans: 中级
zh_hant: 中級

source: Intermediate+
zh_hans: 中级+
zh_hant: 中級+

source: It's not what we do once in a while that shapes our lives. It's what we do consistently.
zh_hans: 塑造我们生活的不是偶尔做的事，而是我们持续做的事。
zh_hant: 塑造我們生活的不是偶爾做的事，而是我們持續做的事。

source: Japanese Proverb
zh_hans: 日本谚语
zh_hant: 日本諺語

source: Keep your workspace clean and organized for better productivity.
zh_hans: 保持工作空间整洁有序，提高工作效率。
zh_hant: 保持工作空間整潔有序，提高工作效率。

source: Key Statistics
zh_hans: 关键统计
zh_hant: 關鍵統計

source: last 2 days
zh_hans: 最近 2 天
zh_hant: 最近 2 天

source: Learn new language
zh_hans: 学习新语言
zh_hant: 學習新語言

source: Legend
zh_hans: 传奇
zh_hant: 傳奇

source: LEGEND! You've achieved the ultimate level! 🚀✨
zh_hans: 传奇！您已达到最高级别！🚀✨
zh_hant: 傳奇！您已達到最高級別！🚀✨

source: Limit processed foods and drinks with added sugars.
zh_hans: 限制加工食品和含添加糖的饮料。
zh_hant: 限制加工食品和含添加糖的飲料。

source: Limit social media
zh_hans: 限制社交媒体
zh_hant: 限制社交媒體

source: Limit social media usage to reduce stress and increase focus.
zh_hans: 限制社交媒体使用以减少压力并提高专注力。
zh_hant: 限制社交媒體使用以減少壓力並提高專注力。

source: Listen to educational or inspiring podcasts during commute or exercise.
zh_hans: 在通勤或运动时收听教育或启发性播客。
zh_hant: 在通勤或運動時收聽教育或啟發性播客。

source: Listen to educational podcast
zh_hans: 收听教育播客
zh_hant: 收聽教育播客

source: Locked
zh_hans: 已锁定
zh_hant: 已鎖定

source: Log Habit Diary
zh_hans: 打卡习惯养成家
zh_hant: 打卡習慣養成家

source: Longest Streak
zh_hans: 最长连胜
zh_hant: 最長連勝

source: Maintain consistent sleep schedule with 7-9 hours of quality rest.
zh_hans: 保持规律作息，确保7-9小时优质睡眠。
zh_hant: 保持規律作息，確保7-9小時優質睡眠。

source: Make bed
zh_hans: 整理床铺
zh_hant: 整理床鋪

source: Making Progress
zh_hans: 正在进步
zh_hant: 正在進步

source: Mark your most important habits as favorites
zh_hans: 将您最重要的习惯标记为收藏
zh_hant: 將您最重要的習慣標記為收藏

source: Master
zh_hans: 大师
zh_hant: 大師

source: Master of habits! Your consistency is legendary! 🌟
zh_hans: 习惯大师！您的坚持已成传奇！🌟
zh_hant: 習慣大師！您的堅持已成傳奇！🌟

source: Max
zh_hans: 最大
zh_hant: 最大

source: Me
zh_hans: 我
zh_hant: 我

source: Meditation
zh_hans: 冥想
zh_hant: 冥想

source: Mode
zh_hans: 模式
zh_hant: 模式

source: Monday
zh_hans: 星期一
zh_hant: 星期一

source: Monitor your streaks and celebrate small victories
zh_hans: 监控您的连胜并庆祝小胜利
zh_hant: 监控您的連勝并庆祝小胜利

source: Monthly
zh_hans: 月
zh_hant: 月

source: monthly progress
zh_hans: 月度进度
zh_hant: 月度進度

source: More Apps
zh_hans: 更多应用
zh_hant: 更多應用

source: More Features
zh_hans: 更多功能
zh_hant: 更多功能

source: Morning walk
zh_hans: 晨间散步
zh_hant: 晨間散步

source: Most Consistent
zh_hans: 最一致
zh_hant: 最一致

source: Motivation
zh_hans: 激励
zh_hant: 激勵

source: My Habit Rating
zh_hans: 我的习惯评级
zh_hant: 我的習慣評級

source: My Habit Rating - Loading...
zh_hans: 我的习惯评级 - 加载中...
zh_hant: 我的習慣評級 - 載入中...

source: My Stats
zh_hans: 我的统计
zh_hant: 我的統計

source: Never miss two days in a row
zh_hans: 永远不要连续错过两天
zh_hant: 永遠不要連續錯過兩天

source: New Habit
zh_hans: 新习惯
zh_hant: 新習慣

source: New habit name
zh_hans: 新习惯名称
zh_hant: 新習慣名稱

source: New Reminder
zh_hans: 新提醒
zh_hant: 新提醒

source: Next >
zh_hans: 下一页 >
zh_hant: 下一頁 >

source: Night Owl
zh_hans: 夜猫子
zh_hant: 夜猫子

source: No Ads:
zh_hans: 无广告：
zh_hant: 无广告：

source: No reminders set
zh_hans: 未设置提醒
zh_hant: 未設定提醒

source: No reminders set for this habit
zh_hans: 此习惯未设置提醒
zh_hant: 此習慣未設定提醒

source: No screens 1 hour before bed
zh_hans: 睡前1小时不看屏幕
zh_hant: 睡前1小時不看螢幕

source: not counted
zh_hans: 不计入
zh_hant: 不计入

source: Notifications are disabled. Please enable them in Settings to receive reminders.
zh_hans: 通知已被禁用。请在设置中启用通知以接收提醒。
zh_hant: 通知已被禁用。请在設定中启用通知以接收提醒。

source: Novice
zh_hans: 新手
zh_hant: 新手

source: Novice+
zh_hans: 新手+
zh_hant: 新手+

source: Once archived, the habit will be hidden from today's habits list, but its check-ins will be kept.
zh_hans: 存档后，该习惯将从今日习惯列表中隐藏，但其签到记录将保留。
zh_hant: 存档后，该習慣将从今日習慣列表中隐藏，但其簽到記錄将保留。

source: Once favorited, the habit will be ordered first in today's habits list.
zh_hans: 收藏后，该习惯将在今日习惯列表中排在首位。
zh_hant: 收藏后，该習慣将在今日習慣列表中排在首位。

source: Orange
zh_hans: 橙色
zh_hant: 橙色

source: Organize workspace
zh_hans: 整理工作台
zh_hant: 整理工作檯

source: Others
zh_hans: 其他
zh_hant: 其他

source: out of 30
zh_hans: 共 30 个
zh_hant: 共 30 個

source: Outstanding
zh_hans: 杰出
zh_hant: 傑出

source: Perfect Month
zh_hans: 完美月份
zh_hant: 完美月份

source: Perfect Week
zh_hans: 完美一周
zh_hant: 完美一週

source: Perfect! You've selected 1 habit to get started. Remember, consistency is more important than quantity. You can always add more habits as you build momentum.
zh_hans: 完美！您选择了1个习惯开始。记住，坚持比数量更重要。随着动力的积累，您随时可以添加更多习惯。
zh_hant: 完美！您選擇了1個習慣開始。記住，堅持比數量更重要。隨著動力的積累，您隨時可以添加更多習慣。

source: Perform small acts of kindness to spread positivity.
zh_hans: 践行小善举，传播正能量。
zh_hant: 踐行小善舉，傳播正能量。

source: Personalized notifications to keep you on track without being overwhelming.
zh_hans: 个性化通知帮助您保持正轨，不会让您感到负担过重。
zh_hant: 個人化通知幫助您保持正軌，不會讓您感到負擔過重。

source: Pink
zh_hans: 粉色
zh_hant: 粉色

source: Plan the day
zh_hans: 规划一天
zh_hant: 規劃一天

source: Play musical instrument
zh_hans: 演奏乐器
zh_hant: 演奏樂器

source: Please describe your issue below
zh_hans: 请在下方描述您的问题
zh_hant: 請在下方描述您的問題

source: points
zh_hans: 分
zh_hant: 分

source: Practice a new language for 15-30 minutes daily.
zh_hans: 每天练习新语言15-30分钟。
zh_hant: 每天練習新語言15-30分鐘。

source: Practice a skill
zh_hans: 练习技能
zh_hant: 練習技能

source: Practice deep breathing for stress relief and relaxation.
zh_hans: 练习深呼吸以缓解压力和放松身心。
zh_hant: 練習深呼吸以緩解壓力和放鬆身心。

source: Practice mindfulness meditation for 10-20 minutes daily.
zh_hans: 每天练习正念冥想10-20分钟。
zh_hant: 每天練習正念冥想10-20分鐘。

source: Practice photography to capture memories and improve creativity.
zh_hans: 练习摄影以捕捉回忆并提高创造力。
zh_hant: 練習攝影以捕捉回憶並提高創造力。

source: Prepare nutritious homemade meals instead of ordering takeout.
zh_hans: 准备营养的家常菜，而不是点外卖。
zh_hant: 準備營養的家常菜，而不是點外賣。

source: Preview
zh_hans: 预览
zh_hant: 預覽

source: Prioritize High-Impact Habits
zh_hans: 优先考虑高影响力习惯
zh_hant: 优先考虑高影響力習慣

source: Privacy Policy
zh_hans: 隐私政策
zh_hant: 隱私政策

source: Progress
zh_hans: 进度
zh_hant: 進度

source: Progress in %@
zh_hans: %@中的进度
zh_hant: %@中的進度

source: Progress to %@
zh_hans: 向 %@ 的进度
zh_hant: 向 %@ 的進度

source: Progress, not perfection, is the goal.
zh_hans: 进步，而非完美，才是目标。
zh_hant: 進步，而非完美，才是目標。

source: Purple
zh_hans: 紫色
zh_hant: 紫色

# Range: %lld - %@ points
source: Range: %1$lld - %2$@ points
zh_hans: 范围: %1$lld - %2$@ 分
zh_hant: 范围: %1$lld - %2$@ 分

source: Rate Us
zh_hans: 给我们评分
zh_hant: 給我们評分

source: Rating
zh_hans: 评分
zh_hant: 評分

source: Rating Levels
zh_hans: 评分等级
zh_hant: 評分等級

source: Rating System
zh_hans: 评分系统
zh_hant: 評分系統

source: Read books, articles, or educational content for personal growth.
zh_hans: 阅读书籍、文章或教育内容促进个人成长。
zh_hant: 閱讀書籍、文章或教育內容促進個人成長。

source: Read for 30 minutes
zh_hans: 阅读30分钟
zh_hant: 閱讀30分鐘

source: Recent
zh_hans: 最近
zh_hant: 最近

source: recent activity
zh_hans: 最近活动
zh_hant: 最近活動

source: Reflect on the week's achievements and plan for the next week.
zh_hans: 回顾本周成就并计划下周目标。
zh_hant: 回顧本週成就並計劃下週目標。

source: Reminders
zh_hans: 提醒
zh_hant: 提醒

source: Remove from Favorites
zh_hans: 从收藏中移除
zh_hant: 從收藏中移除

source: Reset
zh_hans: 重置
zh_hant: 重置

source: Reset to Default
zh_hans: 重置为默认
zh_hant: 重置為預設

source: Reset Today's Motivation
zh_hans: 重置今日励志语录
zh_hant: 重置今日勵志語錄

source: Restore Purchases
zh_hans: 恢复购买
zh_hant: 恢復購買

source: Running
zh_hans: 跑步
zh_hant: 跑步

source: Sample Button
zh_hans: 示例按钮
zh_hant: 示例按鈕

source: Sample Card
zh_hans: 示例卡片
zh_hant: 示例卡片

source: Save
zh_hans: 保存
zh_hant: 儲存

source: Schedule focused work blocks for important tasks.
zh_hans: 为重要任务安排专注的工作时间段。
zh_hant: 為重要任務安排專注的工作時間段。

source: Score Breakdown
zh_hans: 分数明细
zh_hant: 分數明细

source: Score Categories
zh_hans: 分数类别
zh_hant: 分數类别

source: Score Range
zh_hans: 分数范围
zh_hant: 分數范围

source: Score: %lld/%lld
zh_hans: 分数：%1$lld/%2$lld
zh_hant: 分數：%1$lld/%2$lld

source: Select 3-7 habits that resonate with you. Don't worry, you can always add more or modify these later!
zh_hans: 选择3-7个适合您的习惯。别担心，您随时可以添加更多或修改这些习惯！
zh_hant: 選擇3-7個適合您的習慣。別擔心，您隨時可以添加更多或修改這些習慣！

source: Select your preferred primary color for the app
zh_hans: 选择您喜欢的应用程序主色调
zh_hant: 選擇您喜歡的應用程式主色調

source: Set Realistic Goals
zh_hans: 设定现实目标
zh_hant: 設定現實目標

source: Settings
zh_hans: 设置
zh_hant: 設定

source: Share Achievement
zh_hans: 分享成就
zh_hant: 分享成就

source: Share App
zh_hans: 分享应用
zh_hant: 分享應用

source: Share My Stats
zh_hans: 分享我的统计
zh_hant: 分享我的統計

source: Share Your Progress
zh_hans: 分享您的进度
zh_hant: 分享您的進度

source: Show less
zh_hans: 显示更少
zh_hant: 顯示更少

source: Show more
zh_hans: 显示更多
zh_hant: 顯示更多

source: Skincare routine
zh_hans: 护肤程序
zh_hant: 護膚程序

source: Skip for Now
zh_hans: 暂时跳过
zh_hant: 暫時跳過

source: Sleep 7-9 hours
zh_hans: 睡眠 7-9 小时
zh_hant: 睡眠 7-9 小時

source: Sleep by 10 PM
zh_hans: 晚上10点前睡觉
zh_hant: 晚上10點前睡覺

source: Small daily improvements over time lead to stunning results.
zh_hans: 日常的小改进随着时间积累会带来惊人的结果。
zh_hant: 日常的小改進隨著時間積累會帶來驚人的結果。

source: Smart Reminders
zh_hans: 智能提醒
zh_hant: 智能提醒

source: Social activity
zh_hans: 社交活动
zh_hant: 社交活動

source: Sort By
zh_hans: 排序方式
zh_hant: 排序方式

source: Spend 10 minutes each morning planning your day and priorities.
zh_hans: 每天早上花10分钟规划当日安排和优先事项。
zh_hant: 每天早上花10分鐘規劃當日安排和優先事項。

source: Spend 15 minutes decluttering and organizing your living space.
zh_hans: 花15分钟整理和清洁生活空间。
zh_hant: 花15分鐘整理和清潔生活空間。

source: Spend time outdoors
zh_hans: 户外活动
zh_hant: 戶外活動

source: starred
zh_hans: 已收藏
zh_hant: 已收藏

source: Start checking in to track your habits!
zh_hans: 开始签到以跟踪您的习惯！
zh_hant: 開始簽到以追蹤您的習慣！

source: Start small and be consistent - even 1% better each day adds up!
zh_hans: 从小处开始并保持一致——每天进步1%积少成多！
zh_hant: 從小處開始並保持一致——每天進步1%積少成多！
